; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v11 ?v2)
             (pred_6 ?v13 ?v7)
             (pred_12 ?v11 ?v7)
             (pred_9 ?v12 ?v11 )
	     (pred_4 ?v11)
             (pred_7 ?v4)
             (pred_11 ?v13)
             (pred_8 ?v7)
             (pred_3 ?v11)
             (pred_10 ?v13)
             (pred_5 ?v11)
             (pred_2 ))



(:action op_1
:parameters (?v8 ?v3 ?v5 ?v9)
:precondition (and (pred_7 ?v8) (pred_7 ?v3) (pred_11 ?v5) (pred_8 ?v9)
          (pred_1 ?v8 ?v3) (pred_6 ?v5 ?v9)
                   (pred_12 ?v3 ?v9) (pred_4 ?v8) 
                   (pred_3 ?v3) (pred_10 ?v5))
:effect (and  (pred_5 ?v3) (not (pred_3 ?v3))))


(:action op_5
:parameters (?v8 ?v6)
:precondition (and (pred_7 ?v8) (pred_7 ?v6)
               (pred_4 ?v8) (pred_1 ?v8 ?v6) (pred_5 ?v6))
:effect (and (pred_4 ?v6) (not (pred_4 ?v8))))

(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_7 ?v8) (pred_11 ?v5) 
                  (pred_4 ?v8) (pred_9 ?v5 ?v8) (pred_2 ))
:effect (and (pred_10 ?v5)
   (not (pred_9 ?v5 ?v8)) (not (pred_2 ))))


(:action op_2
:parameters (?v8 ?v10 ?v1)
:precondition (and (pred_7 ?v8) (pred_11 ?v10) (pred_11 ?v1)
                  (pred_4 ?v8) (pred_10 ?v1) (pred_9 ?v10 ?v8))
:effect (and (pred_10 ?v10) (pred_9 ?v1 ?v8)
        (not (pred_10 ?v1)) (not (pred_9 ?v10 ?v8))))

(:action op_4
:parameters (?v8 ?v5)
:precondition (and (pred_7 ?v8) (pred_11 ?v5) 
                  (pred_4 ?v8) (pred_10 ?v5))
:effect (and (pred_2 ) (pred_9 ?v5 ?v8) (not (pred_10 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_03 obj_12 obj_07 obj_30 obj_24 obj_08 obj_19 obj_25 obj_09 obj_15 obj_16 obj_04 obj_22 obj_06 obj_26 obj_28 obj_13 obj_18 obj_17 obj_01 obj_20 obj_02 obj_23 obj_11
    obj_29 obj_10
    obj_27 obj_21 obj_05
    )

    (:init
       (pred_2)

       (pred_7 obj_14)
       (pred_7 obj_03)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_30)
       (pred_7 obj_24)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_25)
       (pred_7 obj_09)
       (pred_7 obj_15)
       (pred_7 obj_16)
       (pred_7 obj_04)
       (pred_7 obj_22)
       (pred_7 obj_06)
       (pred_7 obj_26)
       (pred_7 obj_28)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_02)
       (pred_7 obj_23)
       (pred_7 obj_11)
       (pred_8 obj_29)
       (pred_8 obj_10)
       (pred_11 obj_27)
       (pred_11 obj_21)
       (pred_11 obj_05)

       (pred_1 obj_14 obj_24)
       (pred_1 obj_14 obj_03)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_12)
       (pred_1 obj_03 obj_14)
       (pred_1 obj_12 obj_19)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_12 obj_03)
       (pred_1 obj_07 obj_25)
       (pred_1 obj_07 obj_30)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_30 obj_09)
       (pred_1 obj_30 obj_07)
       (pred_1 obj_24 obj_15)
       (pred_1 obj_24 obj_08)
       (pred_1 obj_24 obj_14)
       (pred_1 obj_08 obj_16)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_24)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_25)
       (pred_1 obj_19 obj_12)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_25 obj_22)
       (pred_1 obj_25 obj_09)
       (pred_1 obj_25 obj_07)
       (pred_1 obj_25 obj_19)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_30)
       (pred_1 obj_09 obj_25)
       (pred_1 obj_15 obj_26)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_15 obj_24)
       (pred_1 obj_16 obj_28)
       (pred_1 obj_16 obj_04)
       (pred_1 obj_16 obj_08)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_04 obj_22)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_16)
       (pred_1 obj_22 obj_18)
       (pred_1 obj_22 obj_06)
       (pred_1 obj_22 obj_25)
       (pred_1 obj_22 obj_04)
       (pred_1 obj_06 obj_17)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_06 obj_22)
       (pred_1 obj_26 obj_01)
       (pred_1 obj_26 obj_28)
       (pred_1 obj_26 obj_15)
       (pred_1 obj_28 obj_20)
       (pred_1 obj_28 obj_13)
       (pred_1 obj_28 obj_16)
       (pred_1 obj_28 obj_26)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_13 obj_28)
       (pred_1 obj_18 obj_23)
       (pred_1 obj_18 obj_17)
       (pred_1 obj_18 obj_22)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_17 obj_11)
       (pred_1 obj_17 obj_06)
       (pred_1 obj_17 obj_18)
       (pred_1 obj_01 obj_20)
       (pred_1 obj_01 obj_26)
       (pred_1 obj_20 obj_02)
       (pred_1 obj_20 obj_28)
       (pred_1 obj_20 obj_01)
       (pred_1 obj_02 obj_23)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_20)
       (pred_1 obj_23 obj_11)
       (pred_1 obj_23 obj_18)
       (pred_1 obj_23 obj_02)
       (pred_1 obj_11 obj_17)
       (pred_1 obj_11 obj_23)
       (pred_3 obj_17)
       (pred_3 obj_09)
       (pred_3 obj_01)
       (pred_12  obj_17 obj_29)
       (pred_12  obj_09 obj_10)
       (pred_12  obj_01 obj_29)
       (pred_5 obj_14)
       (pred_5 obj_03)
       (pred_5 obj_12)
       (pred_5 obj_07)
       (pred_5 obj_30)
       (pred_5 obj_24)
       (pred_5 obj_08)
       (pred_5 obj_19)
       (pred_5 obj_25)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_22)
       (pred_5 obj_06)
       (pred_5 obj_26)
       (pred_5 obj_28)
       (pred_5 obj_13)
       (pred_5 obj_18)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_23)
       (pred_5 obj_11)

       (pred_6  obj_27 obj_29)
       (pred_6  obj_21 obj_10)
       (pred_6  obj_05 obj_29)
       (pred_9 obj_27 obj_19)
       (pred_9 obj_21 obj_04)
       (pred_9 obj_05 obj_06)
       (pred_4 obj_24)
    )

    (:goal (and
       (pred_9 obj_05 obj_15)
    ))
(:constraints
  (always (not (pred_4 obj_16)))
)
)

; plan
1. (op_5 obj_24 obj_08)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_08)
   goals met: 0 of 1
2. (op_5 obj_08 obj_19)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_19)
   goals met: 0 of 1
3. (op_5 obj_19 obj_25)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_25)
   goals met: 0 of 1
4. (op_5 obj_25 obj_22)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_22)
   goals met: 0 of 1
5. (op_5 obj_22 obj_06)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_06)
   goals met: 0 of 1
6. (op_3 obj_06 obj_05)
   deleted: (pred_9 obj_05 obj_06) (pred_2)
   added: (pred_10 obj_05)
   goals met: 0 of 1
7. (op_5 obj_06 obj_22)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_22)
   goals met: 0 of 1
8. (op_5 obj_22 obj_04)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_04)
   goals met: 0 of 1
9. (op_5 obj_04 obj_19)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_19)
   goals met: 0 of 1
10. (op_5 obj_19 obj_08)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_08)
   goals met: 0 of 1
11. (op_5 obj_08 obj_24)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_24)
   goals met: 0 of 1
12. (op_5 obj_24 obj_15)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_15)
   goals met: 0 of 1
13. (op_4 obj_15 obj_05)
   deleted: (pred_10 obj_05)
   added: (pred_2) (pred_9 obj_05 obj_15)
   goals met: 1 of 1
